src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_СтаршийМенеджер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_День</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_Месяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаспределения</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактПрошлыйГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ит_ТорговыеТочки_Ответственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ТорговыеТочки_Ответственные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнженерТехПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИТ_ПланПродаж_День.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИТ_ПланПродаж_День</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИТ_ВидыПлановПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_ВидыПлановПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окончательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьТорговыеТочки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ТорговыеТочки.Ссылка КАК ТорговаяТочка,
		|	ИТ_ТорговыеТочки.ит_ДатаОткрытия КАК ДатаОткрытия,
		|	ИТ_ТорговыеТочки.ит_ДатаЗакрытия КАК ДатаЗакрытия,
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер КАК ЛинейныйМенеджер
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ИТ_ТорговыеТочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&Период, ) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|		ПО ИТ_ТорговыеТочки.Ссылка = ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка		
		|ГДЕ
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер = &СтаршийМенеджер
		|	И ИТ_ТорговыеТочки.ит_ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ИТ_ТорговыеТочки.ит_ДатаОткрытия <= КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
		|	И (ИТ_ТорговыеТочки.ит_ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИТ_ТорговыеТочки.ит_ДатаЗакрытия >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер,
		|	ИТ_ТорговыеТочки.Наименование";
	
	Запрос.УстановитьПараметр("СтаршийМенеджер",	СтаршийМенеджер);
	Запрос.УстановитьПараметр("Период",				ПериодПлана);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТорговыеТочки		= РезультатЗапроса.Выгрузить();
	
	ПланПродаж.Загрузить(ТорговыеТочки);
	
КонецПроцедуры

Процедура ЗаполнитьСуммыПланаПродаж(ТорговыеТочки = Неопределено) Экспорт
	
	ТорговыеТочки = ПолучитьТорговыеТочки(ТорговыеТочки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ПланПродаж_Месяц.ТорговаяТочка,
		|	ИТ_ПланПродаж_Месяц.Сумма
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_Месяц КАК ИТ_ПланПродаж_Месяц
		|ГДЕ
		|	ИТ_ПланПродаж_Месяц.Период = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.ВидПлана = &ВидПлана
		|	И ИТ_ПланПродаж_Месяц.ТорговаяТочка В(&ТорговыеТочки)";
	
	Запрос.УстановитьПараметр("Период",			ПериодПлана);
	Запрос.УстановитьПараметр("ВидПлана",		Перечисления.ИТ_ВидыПлановПродаж.Предварительный);
	Запрос.УстановитьПараметр("ТорговыеТочки",	ТорговыеТочки);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтрокаПланаПродаж = ПланПродаж.Найти(Выборка.ТорговаяТочка, "ТорговаяТочка");
		
		Если СтрокаПланаПродаж <> Неопределено Тогда 
			СтрокаПланаПродаж.СуммаПлан = ИТ_СпециальныйМодульСервер.ОкруглитьЦену(Выборка.Сумма, 100, Ложь);	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьСуммыФактаПрошлогоГода(ТорговыеТочки = Неопределено) Экспорт 
	
	ТорговыеТочки = ПолучитьТорговыеТочки(ТорговыеТочки);	
	
	НачалоПериода	= НачалоМесяца(ДобавитьМесяц(ПериодПлана, -12));
	КонецПериода	= КонецМесяца(НачалоПериода);
	ДанныеПродаж	= ИТ_ПланыПродаж_КлиентСервер.ПолучитьФактическиеДанныеПродаж(НачалоПериода, КонецПериода, ТорговыеТочки);
	
	Для Каждого СтрокаДанныхПродаж Из ДанныеПродаж Цикл 
		СтрокиПланаПродаж = ПланПродаж.НайтиСтроки(Новый Структура("ТорговаяТочка", СтрокаДанныхПродаж.ТорговаяТочка));
		
		Если СтрокиПланаПродаж <> Неопределено Тогда 
			Для Каждого СтрокаПланаПродаж Из СтрокиПланаПродаж Цикл 
				СтрокаПланаПродаж.СуммаФактПрошлыйГод = СтрокаДанныхПродаж.Сумма;
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Процедура РаспределитьСуммыПланаПродаж(ТорговыеТочки = Неопределено, СуммаКРаспределению = 0) Экспорт 
	
	НачалоПериода	= НачалоМесяца(ПериодПлана);
	КонецПериода	= КонецМесяца(ПериодПлана);
	ТорговыеТочки	= ПолучитьТорговыеТочки(ТорговыеТочки);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.ТорговаяТочка КАК ТорговаяТочка,
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.Период КАК Период,
		|	ДЕНЬГОДА(ИТ_КоэффициентыРаспределенияПланаПродаж.Период) КАК ДеньГода,
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.МесячныйКоэффициент КАК Коэффициент
		|ПОМЕСТИТЬ КоэфициентыПоДнямГода
		|ИЗ
		|	РегистрСведений.ИТ_КоэффициентыРаспределенияПланаПродаж КАК ИТ_КоэффициентыРаспределенияПланаПродаж
		|ГДЕ
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.ТорговаяТочка В(&ТорговыеТочки)
		|	И ИТ_КоэффициентыРаспределенияПланаПродаж.Период >= &НачалоПериода
		|	И ИТ_КоэффициентыРаспределенияПланаПродаж.Период <= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоэфициентыПоДнямГода.ТорговаяТочка КАК ТорговаяТочка,
		|	МИНИМУМ(КоэфициентыПоДнямГода.ДеньГода) КАК ДеньГода
		|ПОМЕСТИТЬ МинимальныеДниГода
		|ИЗ
		|	КоэфициентыПоДнямГода КАК КоэфициентыПоДнямГода
		|
		|СГРУППИРОВАТЬ ПО
		|	КоэфициентыПоДнямГода.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоэфициентыПоДнямГода.ТорговаяТочка КАК ТорговаяТочка,
		|	КоэфициентыПоДнямГода.Период КАК Период,
		|	КоэфициентыПоДнямГода.Коэффициент КАК Коэффициент,
		|	КоэфициентыПоДнямГода.ДеньГода - МинимальныеДниГода.ДеньГода + 1 КАК ДеньМесяца
		|ПОМЕСТИТЬ РаспределенныеСуммы
		|ИЗ
		|	КоэфициентыПоДнямГода КАК КоэфициентыПоДнямГода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеДниГода КАК МинимальныеДниГода
		|		ПО КоэфициентыПоДнямГода.ТорговаяТочка = МинимальныеДниГода.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспределенныеСуммы.ТорговаяТочка,
		|	РаспределенныеСуммы.Период,
		|	РаспределенныеСуммы.Коэффициент,
		|	РаспределенныеСуммы.ДеньМесяца
		|ИЗ
		|	РаспределенныеСуммы КАК РаспределенныеСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенныеСуммы.ТорговаяТочка КАК ТорговаяТочка
		|ИЗ
		|	РаспределенныеСуммы КАК РаспределенныеСуммы";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("ТорговыеТочки",	ТорговыеТочки);
	
	РезультатЗапроса			= Запрос.ВыполнитьПакет();
	ТаблицаСуммРаспределения	= РезультатЗапроса.Получить(3).Выгрузить();
	ТаблицаТорговыеТочки		= РезультатЗапроса.Получить(4).Выгрузить();
	ТаблицаПериодов				= ИТ_ОбработкаДанных.ПолучитьТаблицуПериодов(НачалоПериода, КонецПериода, Перечисления.Периодичность.День);
	КоличествоДней				= ТаблицаПериодов.Количество();
	
	Если КоличествоДней = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого ТорговаяТочка Из ТорговыеТочки Цикл 
		СтрокаПланаПродаж = ПланПродаж.Найти(ТорговаяТочка, "ТорговаяТочка");
		
		Если СтрокаПланаПродаж = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		Для Каждого СтрокаПериода Из ТаблицаПериодов Цикл 
			ДеньМесяца			= Число(Формат(СтрокаПериода.Период, "ДФ=дд")); // ДеньГода(СтрокаПериода.Период) - ДеньГода(НачалоПериода) + 1; 
			КлючРеквизитаСуммы	= "СуммаДень_" + Формат(ДеньМесяца, "ЧДЦ=0; ЧН=0; ЧГ=0");
			
			СтрокиСуммРаспределения = ТаблицаСуммРаспределения.НайтиСтроки(Новый Структура("ТорговаяТочка,ДеньМесяца", ТорговаяТочка, ДеньМесяца));
			
			Если СтрокиСуммРаспределения.Количество() = 1 Тогда 
				КоэффициетРасчета = СтрокиСуммРаспределения.Получить(0).Коэффициент;	
			Иначе
				КоэффициетРасчета = 1 / КоличествоДней;	
			КонецЕсли;	
			
			Если СуммаКРаспределению = 0 Тогда 
				РасчетнаяСумма = СтрокаПланаПродаж.СуммаПлан * КоэффициетРасчета;
			Иначе
				РасчетнаяСумма = СуммаКРаспределению * КоэффициетРасчета;
			КонецЕсли;
			
			ОкругленнаяСумма	= ИТ_СпециальныйМодульСервер.ОкруглитьЦену(РасчетнаяСумма, 100, Ложь);
			СтрокаПланаПродаж[КлючРеквизитаСуммы] = ОкругленнаяСумма;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПривязатьДокументыРаспределения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка КАК ТорговаяТочка,
		|	МАКСИМУМ(ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка) КАК ДокументРаспределения
		|ПОМЕСТИТЬ ТаблицаДокументовРаспределения
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж
		|		ПО (ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка = &ЭтотДокумент)
		|			И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка = ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.ТорговаяТочка
		|			И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.ПериодПлана = ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.ПериодПлана
		|			И (НЕ ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.ПометкаУдаления)
		|			И (ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ДокументРаспределения = ЗНАЧЕНИЕ(Документ.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументовРаспределения.ТорговаяТочка,
		|	ТаблицаДокументовРаспределения.ДокументРаспределения,
		|	ТаблицаДокументовРаспределения.ДокументРаспределения.Статус КАК Статус
		|ИЗ
		|	ТаблицаДокументовРаспределения КАК ТаблицаДокументовРаспределения";
	Запрос.УстановитьПараметр("ЭтотДокумент", Ссылка);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтрокаПланаПродаж = ПланПродаж.Найти(Выборка.ТорговаяТочка);
		
		Если СтрокаПланаПродаж <> Неопределено Тогда 
			СтрокаПланаПродаж.ДокументРаспределения	= Выборка.ДокументРаспределения;
			СтрокаПланаПродаж.Статус				= Выборка.Статус;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ОбновитьДанныеПоДочернимДокументам(ТорговыеТочки = Неопределено, ДанныеОбновлены = Ложь) Экспорт 
	
	ТорговыеТочки			= ПолучитьТорговыеТочки(ТорговыеТочки);
	Статус_Согласован		= Перечисления.ИТ_СтатусыПлановПродаж.Согласован;
	Статус_НаСогласовании	= Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании;
	Статус_Аннулирован		= Перечисления.ИТ_СтатусыПлановПродаж.Аннулирован;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.ТорговаяТочка,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.Статус,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_1,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_2,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_3,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_4,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_5,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_6,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_7,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_8,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_9,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_10,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_11,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_12,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_13,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_14,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_15,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_16,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_17,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_18,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_19,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_20,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_21,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_22,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_23,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_24,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_25,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_26,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_27,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_28,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_29,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_30,
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.СуммаДень_31
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.ДокументОснование = &ДокументОснование
		|	И ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.ТорговаяТочка В(&ТорговыеТочки)
		|	И НЕ ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.ПометкаУдаления
		|	И ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.Проведен
		|	И (ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.Статус = &Статус_НаСогласовании
		|			ИЛИ ИТ_УстановкаПланаПродаж_ЛинейныйМенеджерПланПродаж.Ссылка.Статус = &Статус_Аннулирован)";
	
	Запрос.УстановитьПараметр("ДокументОснование",		Ссылка);
	Запрос.УстановитьПараметр("ТорговыеТочки",			ТорговыеТочки);
	Запрос.УстановитьПараметр("Статус_НаСогласовании",	Статус_НаСогласовании);
	Запрос.УстановитьПараметр("Статус_Аннулирован",		Статус_Аннулирован);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();

	
	Пока Выборка.Следующий() Цикл 
		СтрокиПланаПродаж = ПланПродаж.НайтиСтроки(Новый Структура("ТорговаяТочка", Выборка.ТорговаяТочка));
		
		Для Каждого СтрокаПланаПродаж Из СтрокиПланаПродаж Цикл 
			Если СтрокаПланаПродаж.Статус <> Статус_Согласован Тогда // если строка согласована СМ, то данные уже не изменяются. 
				ЗаполнитьЗначенияСвойств(СтрокаПланаПродаж, Выборка);
				ДанныеОбновлены = Истина;
				
				Если СтрокаПланаПродаж.Статус = Статус_Аннулирован Тогда 
					СтрокаПланаПродаж.ДокументРаспределения = Неопределено;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТ_УстановкаПланаПродаж_Месяц") Тогда
		Ответственный		= ДанныеЗаполнения.Ответственный;
		ПериодПлана			= ДанныеЗаполнения.ПериодПлана;
		ДокументОснование	= ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления Тогда 
		ИТ_ПланыПродаж.ОбработатьУдалениеДокумента(ЭтотОбъект);
	ИначеЕсли Статус = Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании Тогда
		ДатаОтправкиНаСогласование = ТекущаяДата();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Ссылка.Статус <> Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании 
		И Статус = Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании Тогда  
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГруппыДоступаПользователи.Пользователь.Сотрудник КАК ФизЛицо,
			|	ПРЕДСТАВЛЕНИЕ(ГруппыДоступаПользователи.Пользователь.Сотрудник) КАК ПредставлениеФизЛица,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ФизическиеЛицаКонтактнаяИнформация.АдресЭП = """"""""
			|				ТОГДА ФизическиеЛицаКонтактнаяИнформация.Представление
			|			ИНАЧЕ ФизическиеЛицаКонтактнаяИнформация.АдресЭП
			|		КОНЕЦ, """""""") КАК АдресЭлектроннойПочты
			|ИЗ
			|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ВидыДоступа КАК ГруппДоступаВиды
			|		ПО ГруппыДоступаПользователи.Ссылка = ГруппДоступаВиды.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
			|		ПО (ГруппДоступаВиды.Профиль = ПрофилиГруппДоступаРоли.Ссылка)
			|			И (НЕ ГруппДоступаВиды.Ссылка.ПометкаУдаления)
			|			И (НЕ ПрофилиГруппДоступаРоли.Ссылка.ПометкаУдаления)
			|			И (ПрофилиГруппДоступаРоли.Роль = &Роль)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
			|		ПО ГруппыДоступаПользователи.Пользователь.Сотрудник = ФизическиеЛицаКонтактнаяИнформация.Ссылка
			|			И (ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
			|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailСотрудника))";	
		Запрос.УстановитьПараметр("Роль", Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", "Роль.ИТ_ПланыПродаж_Контролер")); 	
		
		Результат		= Запрос.Выполнить();
		ТаблицаАдресов	= Результат.Выгрузить();
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.СтаршийМенеджер КАК СтаршийМенеджер,
			|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПериодПлана КАК ПериодПлана,
			|	""2019-01"" КАК ПериодПлана_Представление,
			|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ДатаОтправкиНаСогласование КАК ДатаОтправкиНаСогласование,
			|	""31 ЯнваряДекабря 3999 г. 00:00:00"" КАК ДатаОтправкиНаСогласование_Представление
			|ИЗ
			|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджер
			|ГДЕ
			|	ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПериодПлана = &ПериодПлана
			|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджер.Проведен
			|	И НЕ ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПериодПлана", ПериодПлана);
		
		Результат		= Запрос.Выполнить();
		ТаблицаСтатусов	= Результат.Выгрузить();
		
		Для Каждого СтрокаСтатуса Из ТаблицаСтатусов Цикл 
			СтрокаСтатуса.ПериодПлана_Представление = Формат(СтрокаСтатуса.ПериодПлана, "ДФ=гггг-ММ");	
			
			Если ЗначениеЗаполнено(СтрокаСтатуса.ДатаОтправкиНаСогласование) Тогда 
				СтрокаСтатуса.ДатаОтправкиНаСогласование_Представление = Формат(СтрокаСтатуса.ДатаОтправкиНаСогласование, "ДЛФ=DDT");	
			Иначе
				СтрокаСтатуса.ДатаОтправкиНаСогласование_Представление = "Не отправлено";
			КонецЕсли;
		КонецЦикла;	
		
		ТаблицаСтатусов.Колонки.Удалить("ПериодПлана");
		ТаблицаСтатусов.Колонки.Удалить("ДатаОтправкиНаСогласование");
		
		ТаблицаСтатусов.Колонки.Найти("СтаршийМенеджер").Заголовок				= "Старший менеджер";
		ТаблицаСтатусов.Колонки.Найти("ПериодПлана_Представление").Заголовок	= "Период планирования";
		ТаблицаСтатусов.Колонки.Найти("ДатаОтправкиНаСогласование_Представление").Заголовок	= "Отправлено на согласование";
		
		ПараметрыТаблицыЗначений	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыТаблицыЗначенийКакHTML("Статусы по менеджерам"); 
		ТаблицаСтатусовHTML			= ИТ_СпециальныйМодульСервер.ПолучитьТаблицуЗначенийКакHTML(ТаблицаСтатусов, ПараметрыТаблицыЗначений); 
		
		МассивАдресатов	= ИТ_СпециальныйМодульСервер.ПолучитьАдресатовПоКоллекции(ТаблицаАдресов, "АдресЭлектроннойПочты", "ПредставлениеФизЛица");
		ПараметрыПочты	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПочты();
		ТемаПисьма		= СтрШаблон("План продаж ФММР_%1_%2 на согласовании", Формат(ПериодПлана, "ДФ=гггг-ММ"), Строка(СтаршийМенеджер));
		ТелоПисьма		= ИТ_СпециальныйМодульСервер.СформироватьHTML(, ТаблицаСтатусовHTML); 
		АдресОтвета		= ИТ_СпециальныйМодульСервер.ПолучитьАдресСистемнойУчетнойЗаписи();
		ТипПисьма		= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		ПараметрыПисьма	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПисьма(МассивАдресатов, ТемаПисьма, ТелоПисьма, АдресОтвета, ТипПисьма, ПараметрыПочты.Профиль);	
		
		ИТ_СпециальныйМодульСервер.ОтправитьПисьмо(ПараметрыПочты, ПараметрыПисьма);
		
	ИначеЕсли Статус = Перечисления.ИТ_СтатусыПлановПродаж.Согласован Тогда 
		
		Движения.ИТ_ПланПродаж_День.Записывать = Истина;
		
		ГодПлана		= Год(ПериодПлана);
		МесяцПлана		= Месяц(ПериодПлана);
		КоличествоДней	= День(КонецМесяца(ПериодПлана));
		
		Для Каждого СтрокаПланаПродаж Из ПланПродаж Цикл
			Для НомерДня = 1 По КоличествоДней Цикл 
				КлючПоляСтроки	= "СуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
				Движение		= Движения.ИТ_ПланПродаж_День.Добавить();
				
				Движение.Период			= Дата(ГодПлана, МесяцПлана, НомерДня);
				Движение.ТорговаяТочка	= СтрокаПланаПродаж.ТорговаяТочка;
				Движение.Сумма			= СтрокаПланаПродаж[КлючПоляСтроки];
			КонецЦикла;
		КонецЦикла;
		
		ИТ_ПланыПродаж.РассчитатьКоличествоКгНабораЗаписей(Движения.ИТ_ПланПродаж_День);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТорговыеТочки(ТорговыеТочки)
	
	Если ТорговыеТочки = Неопределено Тогда 
		МассивТорговыхТочек = ПланПродаж.ВыгрузитьКолонку("ТорговаяТочка");
	Иначе
		Если ТипЗнч(ТорговыеТочки) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда 
			МассивТорговыхТочек = Новый Массив();
			МассивТорговыхТочек.Добавить(ТорговыеТочки);
		ИначеЕсли ТипЗнч(ТорговыеТочки) = Тип("Массив") Тогда 
			МассивТорговыхТочек = ТорговыеТочки;
		Иначе
			ВызватьИсключение ("Неверный тип параметра ""ТорговыеТочки""");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат МассивТорговыхТочек;
	
КонецФункции	

Функция ПолучитьИдентификаторОбъектаМетаданных()
	
	ПолноеИмяМетаданных				= СтрШаблон("Документ.%1", ЭтотОбъект.Метаданные().Имя);
	ИдентификаторОбъектаМетаданных	= Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмяМетаданных);	
	
	Возврат ИдентификаторОбъектаМетаданных;
	
КонецФункции	

#КонецОбласти
